#!/usr/bin/env python3
# Thanathorn chanaphochai
# 670510755
# HW01_3
# 229223 Sec 001



# ให้ x รับค่า Old price
x = float(input("Old Price: "))
# ให้ x+50 เพราะ ถ้า x ในหลักสิบน้อยกว่า 50 จะบวก 50 ยังกไงหลักสิบก็ไม่ถึงหนึ่งร้อย เเต่ถ้า x ในหลักสิบมากกว่า50 ก็จะบวกได้เกินหรือเท่ากับหนึ่งร้อน 
# ดังนั้นก็จะป้ดเศษได้ด้วยการ // เเล้วก็นำค่าที่ได้ไปคูณหนึ่งร้อยเพื่อจะเต็มหลักร้อย เช่น  320+50 = 370    
# 370 // 100  = 3
# 3*100 = 300 เเล้วจึงนำไป -2
# เพื่อใฟ้ได้หลักสิบเท่ากับ98
y = int((x+50) // 100 * 100 -2)

print("New Price:", y)
